---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExternalService.ExternalServiceRegistry
source: html/28f723d1-2af4-783f-24cd-c4d5be72bb49.htm
---
# ExternalServiceRegistry Methods

Execute a service independently of any document.